In [1]:
import pandas as pd #use pandas property 
import numpy as np #use to numpy 
import matplotlib.pyplot as plt #use to create or plot graph
from scipy import stats #use to mode and z_scores

In [2]:
df = pd.read_csv("retail_store_sales.csv")

In [3]:
df.head()

,Transaction ID,Customer ID,Category,Item,Price Per Unit,Quantity,Total Spent,Payment Method,Location,Transaction Date,Discount Applied
0,TXN_6867343,CUST_09,Patisserie,Item_10_PAT,18.5,10.0,185.0,Digital Wallet,Online,2024-04-08,True
1,TXN_3731986,CUST_22,Milk Products,Item_17_MILK,29.0,9.0,261.0,Digital Wallet,Online,2023-07-23,True
2,TXN_9303719,CUST_02,Butchers,Item_12_BUT,21.5,2.0,43.0,Credit Card,Online,2022-10-05,False
3,TXN_9458126,CUST_06,Beverages,Item_16_BEV,27.5,9.0,247.5,Credit Card,Online,2022-05-07,NaN
4,TXN_4575373,CUST_05,Food,Item_6_FOOD,12.5,7.0,87.5,Digital Wallet,Online,2022-10-02,False

In [4]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 12575 entries, 0 to 12574
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    12575 non-null  str
 1   Customer ID       12575 non-null  str
 2   Category          12575 non-null  str
 3   Item              11362 non-null  str
 4   Price Per Unit    11966 non-null  float64
 5   Quantity          11971 non-null  float64
 6   Total Spent       11971 non-null  float64
 7   Payment Method    12575 non-null  str
 8   Location          12575 non-null  str
 9   Transaction Date  12575 non-null  str
 10  Discount Applied  8376 non-null   object
dtypes: float64(3), object(1), str(7)
memory usage: 1.1+ MB

In [5]:
df.isna().sum()

Transaction ID         0
Customer ID            0
Category               0
Item                1213
Price Per Unit       609
Quantity             604
Total Spent          604
Payment Method         0
Location               0
Transaction Date       0
Discount Applied    4199
dtype: int64

In [6]:
df.dropna(inplace=True)

In [7]:
df.info()

<class 'pandas.DataFrame'>
Index: 7579 entries, 0 to 12573
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    7579 non-null   str
 1   Customer ID       7579 non-null   str
 2   Category          7579 non-null   str
 3   Item              7579 non-null   str
 4   Price Per Unit    7579 non-null   float64
 5   Quantity          7579 non-null   float64
 6   Total Spent       7579 non-null   float64
 7   Payment Method    7579 non-null   str
 8   Location          7579 non-null   str
 9   Transaction Date  7579 non-null   str
 10  Discount Applied  7579 non-null   object
dtypes: float64(3), object(1), str(7)
memory usage: 710.5+ KB

In [8]:
df.isnull().shape

(7579, 11)

In [9]:
df["Transaction ID"].duplicated().sum()

np.int64(0)

In [10]:
df["Customer ID"].value_counts()

Customer ID
CUST_05    352
CUST_13    336
CUST_01    324
CUST_24    323
CUST_16    320
CUST_08    319
CUST_15    317
CUST_22    311
CUST_23    310
CUST_20    308
CUST_12    301
CUST_02    300
CUST_06    300
CUST_09    299
CUST_18    299
CUST_10    298
CUST_07    295
CUST_11    293
CUST_17    291
CUST_14    289
CUST_21    288
CUST_04    286
CUST_19    279
CUST_25    272
CUST_03    269
Name: count, dtype: int64

In [11]:
 df["Discount Applied"].fillna(df["Discount Applied"].mode()[0],inplace=True)

C:\Users\Roshan\AppData\Local\Temp\ipykernel_11340\2834673353.py:1: ChainedAssignmentError: A value is being set on a copy of a DataFrame or Series through chained assignment using an inplace method.
Such inplace method never works to update the original DataFrame or Series, because the intermediate object on which we are setting values always behaves as a copy (due to Copy-on-Write).

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' instead, to perform the operation inplace on the original object, or try to avoid an inplace operation using 'df[col] = df[col].method(value)'.

See the documentation for a more detailed explanation: https://pandas.pydata.org/pandas-docs/stable/user_guide/copy_on_write.html
  df["Discount Applied"].fillna(df["Discount Applied"].mode()[0],inplace=True)

0         True
1         True
2        False
4        False
6         True
         ...
12566    False
12567    False
12569    False
12571    False
12573     True
Name: Discount Applied, Length: 7579, dtype: object

In [12]:
df["Discount Applied"].value_counts()

Discount Applied
True     3801
False    3778
Name: count, dtype: int64

In [13]:
df.isna().sum()

Transaction ID      0
Customer ID         0
Category            0
Item                0
Price Per Unit      0
Quantity            0
Total Spent         0
Payment Method      0
Location            0
Transaction Date    0
Discount Applied    0
dtype: int64

In [18]:
df.info()

<class 'pandas.DataFrame'>
Index: 7579 entries, 0 to 12573
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    7579 non-null   str
 1   Customer ID       7579 non-null   str
 2   Category          7579 non-null   str
 3   Item              7579 non-null   str
 4   Price Per Unit    7579 non-null   float64
 5   Quantity          7579 non-null   float64
 6   Total Spent       7579 non-null   float64
 7   Payment Method    7579 non-null   str
 8   Location          7579 non-null   str
 9   Transaction Date  7579 non-null   str
 10  Discount Applied  7579 non-null   object
dtypes: float64(3), object(1), str(7)
memory usage: 710.5+ KB

In [19]:
df["Transaction Date"]=pd.to_datetime(df["Transaction Date"])

In [20]:
df.info()

<class 'pandas.DataFrame'>
Index: 7579 entries, 0 to 12573
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    7579 non-null   str
 1   Customer ID       7579 non-null   str
 2   Category          7579 non-null   str
 3   Item              7579 non-null   str
 4   Price Per Unit    7579 non-null   float64
 5   Quantity          7579 non-null   float64
 6   Total Spent       7579 non-null   float64
 7   Payment Method    7579 non-null   str
 8   Location          7579 non-null   str
 9   Transaction Date  7579 non-null   datetime64[us]
 10  Discount Applied  7579 non-null   object
dtypes: datetime64[us](1), float64(3), object(1), str(6)
memory usage: 710.5+ KB

In [21]:
df.head()

,Transaction ID,Customer ID,Category,Item,Price Per Unit,Quantity,Total Spent,Payment Method,Location,Transaction Date,Discount Applied
0,TXN_6867343,CUST_09,Patisserie,Item_10_PAT,18.5,10.0,185.0,Digital Wallet,Online,2024-04-08,True
1,TXN_3731986,CUST_22,Milk Products,Item_17_MILK,29.0,9.0,261.0,Digital Wallet,Online,2023-07-23,True
2,TXN_9303719,CUST_02,Butchers,Item_12_BUT,21.5,2.0,43.0,Credit Card,Online,2022-10-05,False
4,TXN_4575373,CUST_05,Food,Item_6_FOOD,12.5,7.0,87.5,Digital Wallet,Online,2022-10-02,False
6,TXN_3652209,CUST_07,Food,Item_1_FOOD,5.0,8.0,40.0,Credit Card,In-store,2023-06-10,True

In [22]:
#Top Selling Items
df.groupby("Item")["Quantity"].sum().sort_values(ascending=False).head(5)

Item
Item_16_MILK    454.0
Item_11_MILK    440.0
Item_22_BUT     418.0
Item_12_CEA     403.0
Item_2_BEV      403.0
Name: Quantity, dtype: float64

In [23]:
#Highest Revenue Items 
df.groupby("Item")["Total Spent"].sum().sort_values(ascending=False).head(5)

Item
Item_22_BUT    15257.0
Item_25_FUR    14801.0
Item_25_BUT    14678.0
Item_24_FUR    14615.0
Item_25_EHE    13735.0
Name: Total Spent, dtype: float64

In [24]:
#Total Sales 
df["Transaction ID"].nunique()

7579

In [25]:
# Discount Applied Analysis
# Discount vs No Discount Revenue
df.groupby("Discount Applied")["Total Spent"].sum()

Discount Applied
False    491632.5
True     496880.5
Name: Total Spent, dtype: float64

In [26]:
# Discount par average bill
df.groupby("Discount Applied")["Total Spent"].mean()

Discount Applied
False    130.130360
True     130.723625
Name: Total Spent, dtype: float64